In [2]:
import pandas as pd

In [26]:
a = pd.Series(data=[1,3,3,4],index=['a','b','c','d'],)
a

a    1
b    3
c    3
d    4
dtype: int64

In [27]:
b = pd.Series(["Tall","Short","Tall","Tall"],['a','b','c','d'])
b

a     Tall
b    Short
c     Tall
d     Tall
dtype: object

In [28]:
df = pd.DataFrame([a,b]).transpose()

In [29]:
df

   0      1
a  1   Tall
b  3  Short
c  3   Tall
d  4   Tall

In [30]:
df.columns=["Year","Height"]

In [31]:
df

  Year Height
a    1   Tall
b    3  Short
c    3   Tall
d    4   Tall

In [32]:
df=df.set_index("Year")

In [33]:
df

     Height
Year
1      Tall
3     Short
3      Tall
4      Tall